'''

'''
'''
HTML
    1.一套浏览器认识的规则
    2.开发者：
        学习html规则
        开发后台程序
            写HTML文件（充当模板）
            数据库获取数据，然后替换到HTML文件的指定位置（web 框架）
    3.本地测试
        找到文件路径，浏览器打开
        pycharm打开
    4.编写HTML文件
        doctype对应关系 
        HTML标签，标签内部可以写属性  只能有一个HTML标签
        注释 <!--  注释的内容  -->
    5.标签分类
        自闭合标签   <meta charset="UTF-8">
        主动闭合标签  <title>百度</title>
    6.head标签
        <meta> 编码，跳转，刷新，关键字，描述，兼容
        title标签
        <link/> 图标
        <style/>
        <script/>
    7.body标签
        图标：&nbsp;  &gt;  &lt;
        p标签     段落
        br标签    换行
        -----小总结-----
            所以标签分为：
                快级标签：    h系列（特点：加大加粗），p系列（段落和段落之间有间距）
                行内标签：    span标签（白板，不带任何特性）
    -20个标签
CSS
    -颜色
    -位置
'''

